// 출처 나무위키
var master_label_pet = [
    {
        seq: '1',
        flag: '1기',        
        name: '쁘띠 페어리 세트',
        pet_name: '오베론, 티타니아, 쁘띠 피코',
        period: [
            '2018.09.20 ~ 2018.10.17',
            '2019.01.31 ~ 2019.02.20',
            '2019.04.25 ~ 2019.05.22',
        ]
    },
    {
        seq: '2',
        flag: '2기',
        name: '쁘띠 포니 세트',
        pet_name: '빅토리, 글로리, 쁘띠 포니',
        period: [
            '2019.08.29 ~ 2019.09.25',
            '2020.01.16 ~ 2020.02.11',
            '2020.04.23 ~ 2020.05.20',
            '2020.07.23 ~ 2020.08.19',
        ]
    },
    {
        seq: '3',
        flag: '3기',
        name: '쁘띠 초롱나비 세트',
        pet_name: '황혼, 신야, 쁘띠 초롱',
        period: [
            '2020.09.17 ~ 2020.10.21',
            '2021.01.28 ~ 2021.03.03'
        ]
    },
];
