var soul = [
    {
        tier: '1',
        ko_name: '데미안',
        en_name: 'demian',
        skill: '데미안의 혼이 당신과 함께 한다. 소울웨폰의 힘으로 소환된 데미안이 일정시간 동안 주변 몬스터들을 공격한다.',
        skill_w_detail: '250소울을 소모하여 120초간 공격력 1800%의 데미안 소환. 재사용 대기시간 180초',
        skill_w: '데미안의 혼이 당신과 함께 한다. 타락한 세계수의 힘으로 각성한 모습이다. 소울웨폰의 힘으로 소환된 데미안이 일정시간 동안 주변 몬스터들을 공격한다.',
        skill_detail: '250소울을 소모하여 120초간 공격력 1800/2200%의 각성 데미안 소환. 재사용 대기시간 180초',        
        
    }
];

var soul_option = {

    tier_1 : {        
        opt1: 'STR + 24'        // 기운찬
        ,opt2: 'DEX + 24'       // 날렵한
        ,opt3: 'INT + 24'       // 총명한
        ,opt4: 'LUK + 24'       // 놀라운
        ,opt5: 'ALL + 24'       // 화려한
        ,opt6: '공격력 + 6'     // 강력한
        ,opt7: '마력 + 6'       // 빛나는
        ,opt8: 'HP & MP + 960'  // 강인한
    },
    tier_1_w : {
        opt1: '공격력 + 3%'
        ,opt2: '마력 + 3%'
        ,opt3: '올스탯 + 5%'
        ,opt4: 'HP + 2000'
        ,opt5: '크리티컬 확률 + 12%'
        ,opt6: '방어력 무시 + 7%'
        ,opt7: '보스 몬스터 공격 시 데미지 + 7%'
    }


}
