var soul = [
    'murgoth',
    'queen',
    'vellum',
    'magnus',
    'cygnus',
    'lotus',
    'demian',
    'lucid',
    'will',
    'darknell',
    'verus_hilla',
    
];

var soul_obj = {
    murgoth: {
        tier: '1',
        ko_name: '무르무르',
        en_name: 'murgoth',
        skill: '데미안의 혼이 당신과 함께 한다. 소울웨폰의 힘으로 소환된 데미안이 일정시간 동안 주변 몬스터들을 공격한다.',
        skill_w_detail: '250소울을 소모하여 120초간 공격력 1800%의 데미안 소환. 재사용 대기시간 180초',
        skill_w: '데미안의 혼이 당신과 함께 한다. 타락한 세계수의 힘으로 각성한 모습이다. 소울웨폰의 힘으로 소환된 데미안이 일정시간 동안 주변 몬스터들을 공격한다.',
        skill_detail: '250소울을 소모하여 120초간 공격력 1800/2200%의 각성 데미안 소환. 재사용 대기시간 180초',
        img1: [
            'murgoth1.gif',
            'murgoth1-1.gif',
            'murgoth1-2.gif',
        ],
        img2: [
            'murgoth2.gif',
            'murgoth2-1.gif',
            'murgoth2-2.gif',
        ]
        
    },
    queen: {
        tier: '1',
        ko_name: '블러디퀸',
        en_name: 'queen',
        skill: '데미안의 혼이 당신과 함께 한다. 소울웨폰의 힘으로 소환된 데미안이 일정시간 동안 주변 몬스터들을 공격한다.',
        skill_w_detail: '250소울을 소모하여 120초간 공격력 1800%의 데미안 소환. 재사용 대기시간 180초',
        skill_w: '데미안의 혼이 당신과 함께 한다. 타락한 세계수의 힘으로 각성한 모습이다. 소울웨폰의 힘으로 소환된 데미안이 일정시간 동안 주변 몬스터들을 공격한다.',
        skill_detail: '250소울을 소모하여 120초간 공격력 1800/2200%의 각성 데미안 소환. 재사용 대기시간 180초',
        img1: [
            'queen1.gif',
            'queen1-1.gif',
        ],
        img2: [
            'queen2.gif',
            'queen2-11.gif',
            'queen2-12.gif',
            'queen2-21.gif',
            'queen2-22.gif',
            'queen2-31.gif',
            'queen2-32.gif',
            'queen2-41.gif',
            'queen2-42.gif'
        ]
        
    },
    vellum: {
        tier: '1',
        ko_name: '벨룸',
        en_name: 'vellum',
        skill: '데미안의 혼이 당신과 함께 한다. 소울웨폰의 힘으로 소환된 데미안이 일정시간 동안 주변 몬스터들을 공격한다.',
        skill_w_detail: '250소울을 소모하여 120초간 공격력 1800%의 데미안 소환. 재사용 대기시간 180초',
        skill_w: '데미안의 혼이 당신과 함께 한다. 타락한 세계수의 힘으로 각성한 모습이다. 소울웨폰의 힘으로 소환된 데미안이 일정시간 동안 주변 몬스터들을 공격한다.',
        skill_detail: '250소울을 소모하여 120초간 공격력 1800/2200%의 각성 데미안 소환. 재사용 대기시간 180초',
        img1: [
            'vellum1.gif',
            'vellum1-1.gif',
        ],
        img2: [
            'vellum2.gif',
            'vellum2-1.gif',
            'vellum2-2.gif'
        ]
        
    },
    magnus: {
        tier: '1',
        ko_name: '매그너스',
        en_name: 'magnus',
        skill: '데미안의 혼이 당신과 함께 한다. 소울웨폰의 힘으로 소환된 데미안이 일정시간 동안 주변 몬스터들을 공격한다.',
        skill_w_detail: '250소울을 소모하여 120초간 공격력 1800%의 데미안 소환. 재사용 대기시간 180초',
        skill_w: '데미안의 혼이 당신과 함께 한다. 타락한 세계수의 힘으로 각성한 모습이다. 소울웨폰의 힘으로 소환된 데미안이 일정시간 동안 주변 몬스터들을 공격한다.',
        skill_detail: '250소울을 소모하여 120초간 공격력 1800/2200%의 각성 데미안 소환. 재사용 대기시간 180초',
        img1: [
            'magnus1.gif',
            'magnus1-1.gif',
        ],
        img2: [
            'magnus2.gif',
            'magnus2-1.gif',
            'magnus2-2.gif',
        ]
        
    },
    cygnus: {
        tier: '1',
        ko_name: '시그너스',
        en_name: 'cygnus',
        skill: '데미안의 혼이 당신과 함께 한다. 소울웨폰의 힘으로 소환된 데미안이 일정시간 동안 주변 몬스터들을 공격한다.',
        skill_w_detail: '250소울을 소모하여 120초간 공격력 1800%의 데미안 소환. 재사용 대기시간 180초',
        skill_w: '데미안의 혼이 당신과 함께 한다. 타락한 세계수의 힘으로 각성한 모습이다. 소울웨폰의 힘으로 소환된 데미안이 일정시간 동안 주변 몬스터들을 공격한다.',
        skill_detail: '250소울을 소모하여 120초간 공격력 1800/2200%의 각성 데미안 소환. 재사용 대기시간 180초',
        img1: [
            'cygnus1.gif',
            'cygnus1-1.gif',
            'cygnus1-2.gif',
        ],
        img2: [
            'cygnus2.gif',
            'cygnus2-1.gif',
            'cygnus2-2.gif',
        ]
        
    },
    lotus: {
        tier: '1',
        ko_name: '스우',
        en_name: 'lotus',
        skill: '데미안의 혼이 당신과 함께 한다. 소울웨폰의 힘으로 소환된 데미안이 일정시간 동안 주변 몬스터들을 공격한다.',
        skill_w_detail: '250소울을 소모하여 120초간 공격력 1800%의 데미안 소환. 재사용 대기시간 180초',
        skill_w: '데미안의 혼이 당신과 함께 한다. 타락한 세계수의 힘으로 각성한 모습이다. 소울웨폰의 힘으로 소환된 데미안이 일정시간 동안 주변 몬스터들을 공격한다.',
        skill_detail: '250소울을 소모하여 120초간 공격력 1800/2200%의 각성 데미안 소환. 재사용 대기시간 180초',
        img1: [
            'lotus1.gif',
            'lotus1-1.gif',
            'lotus1-2.gif'
        ],
        img2: [
            'lotus2.gif',
            'lotus2-1.gif',
            'lotus2-2.gif'
        ]
        
    },
    demian: {
        tier: '1',
        ko_name: '데미안',
        en_name: 'demian',
        skill: '데미안의 혼이 당신과 함께 한다. 소울웨폰의 힘으로 소환된 데미안이 일정시간 동안 주변 몬스터들을 공격한다.',
        skill_w_detail: '250소울을 소모하여 120초간 공격력 1800%의 데미안 소환. 재사용 대기시간 180초',
        skill_w: '데미안의 혼이 당신과 함께 한다. 타락한 세계수의 힘으로 각성한 모습이다. 소울웨폰의 힘으로 소환된 데미안이 일정시간 동안 주변 몬스터들을 공격한다.',
        skill_detail: '250소울을 소모하여 120초간 공격력 1800/2200%의 각성 데미안 소환. 재사용 대기시간 180초',
        img1: [
            'demian1.gif',
            'demian1-1.gif',
            'demian1-2.gif'
        ],
        img2: [
            'demian2.gif',
            'demian2-1.gif',
            'demian2-2.gif'
        ]
        
    },
    lucid: {
        tier: '1',
        ko_name: '루시드',
        en_name: 'lucid',
        skill: '데미안의 혼이 당신과 함께 한다. 소울웨폰의 힘으로 소환된 데미안이 일정시간 동안 주변 몬스터들을 공격한다.',
        skill_w_detail: '250소울을 소모하여 120초간 공격력 1800%의 데미안 소환. 재사용 대기시간 180초',
        skill_w: '데미안의 혼이 당신과 함께 한다. 타락한 세계수의 힘으로 각성한 모습이다. 소울웨폰의 힘으로 소환된 데미안이 일정시간 동안 주변 몬스터들을 공격한다.',
        skill_detail: '250소울을 소모하여 120초간 공격력 1800/2200%의 각성 데미안 소환. 재사용 대기시간 180초',
        img1: [
            'lucid1.gif',
            'lucid1-1.gif',
            'lucid1-2.gif'
        ],
        img2: [
            'lucid2.gif',
            'lucid2-1.gif',
            'lucid2-2.gif'
        ]
        
    },
    will: {
        tier: '1',
        ko_name: '윌',
        en_name: 'will',
        skill: '데미안의 혼이 당신과 함께 한다. 소울웨폰의 힘으로 소환된 데미안이 일정시간 동안 주변 몬스터들을 공격한다.',
        skill_w_detail: '250소울을 소모하여 120초간 공격력 1800%의 데미안 소환. 재사용 대기시간 180초',
        skill_w: '데미안의 혼이 당신과 함께 한다. 타락한 세계수의 힘으로 각성한 모습이다. 소울웨폰의 힘으로 소환된 데미안이 일정시간 동안 주변 몬스터들을 공격한다.',
        skill_detail: '250소울을 소모하여 120초간 공격력 1800/2200%의 각성 데미안 소환. 재사용 대기시간 180초',
        img1: [
            'will1.gif',
            'will1-1.gif'
        ],
        img2: [
            'will2.gif',
            'will2-1.gif',
            'will2-2.gif'
        ]
        
    },    
    darknell: {
        tier: '1',
        ko_name: '듄켈',
        en_name: 'darknell',
        skill: '데미안의 혼이 당신과 함께 한다. 소울웨폰의 힘으로 소환된 데미안이 일정시간 동안 주변 몬스터들을 공격한다.',
        skill_w_detail: '250소울을 소모하여 120초간 공격력 1800%의 데미안 소환. 재사용 대기시간 180초',
        skill_w: '데미안의 혼이 당신과 함께 한다. 타락한 세계수의 힘으로 각성한 모습이다. 소울웨폰의 힘으로 소환된 데미안이 일정시간 동안 주변 몬스터들을 공격한다.',
        skill_detail: '250소울을 소모하여 120초간 공격력 1800/2200%의 각성 데미안 소환. 재사용 대기시간 180초',
        img1: [
            'darknell1.gif',
            'darknell1-1.gif'
        ],
        img2: [
            'darknell2.gif',
            'darknell2-1.gif',
            'darknell2-2.gif'
        ]
        
    },
    verus_hilla: {
        tier: '1',
        ko_name: '진힐라',
        en_name: 'verus_hilla',
        skill: '데미안의 혼이 당신과 함께 한다. 소울웨폰의 힘으로 소환된 데미안이 일정시간 동안 주변 몬스터들을 공격한다.',
        skill_w_detail: '250소울을 소모하여 120초간 공격력 1800%의 데미안 소환. 재사용 대기시간 180초',
        skill_w: '데미안의 혼이 당신과 함께 한다. 타락한 세계수의 힘으로 각성한 모습이다. 소울웨폰의 힘으로 소환된 데미안이 일정시간 동안 주변 몬스터들을 공격한다.',
        skill_detail: '250소울을 소모하여 120초간 공격력 1800/2200%의 각성 데미안 소환. 재사용 대기시간 180초',
        img1: [
            'verus_hilla1.gif',
            'verus_hilla1-1.gif'
        ],
        img2: [
            'verus_hilla2.gif',
            'verus_hilla2-1.gif',
            'verus_hilla2-2.gif'
        ]
        
    },
};

var soul_option = {

    tier_1 : {        
        opt1: 'STR + 24'        // 기운찬
        ,opt2: 'DEX + 24'       // 날렵한
        ,opt3: 'INT + 24'       // 총명한
        ,opt4: 'LUK + 24'       // 놀라운
        ,opt5: 'ALL + 24'       // 화려한
        ,opt6: '공격력 + 6'     // 강력한
        ,opt7: '마력 + 6'       // 빛나는
        ,opt8: 'HP & MP + 960'  // 강인한
    },
    tier_1w : {
        opt1: '공격력 + 3%'
        ,opt2: '마력 + 3%'
        ,opt3: '올스탯 + 5%'
        ,opt4: 'HP + 2000'
        ,opt5: '크리티컬 확률 + 12%'
        ,opt6: '방어력 무시 + 7%'
        ,opt7: '보스 몬스터 공격 시 데미지 + 7%'
    }


}


/*

// 1티어 

1. 듄켈

2. 진 힐라

3. 무르무르

4. 데미안

5. 윌

6. 루시드

7. 스우

8. 매그너스

9. 시그너스

10. 벨룸

11. 블러디 퀸

12. 무르무르

공격력 / 마력 +3%

-올스텟 5%

- MHP +20000

-크리티컬 확률 +12%

-몬스터 방어율 무시 +7%

-보스 몬스터 공격시 데미지 +7%

-스킬 레벨 +2증가





// 2티어

-반반

-피에르

-우르스

-핑크빈


-공격력/마력 +10

-올스텟 +20

-MHP + 1500

-크리티컬 확률 +10%

-몬스터 방어율 무시 +5%

-보스 몬스터 공격시 데미지 +5%





*/

